#### .deploy の結果を表示する。 979a925
#### Terraform apply 📖`success`

<details><summary>Show Apply Result</summary>

```terraform
aws_acm_certificate.main: Refreshing state... [id=arn:aws:acm:us-east-1:554506578892:certificate/cd63d2a1-3d6f-471d-958e-45a76da21eb0]
aws_api_gateway_rest_api.example: Refreshing state... [id=uo7vejn591]
aws_cloudwatch_log_group.log_group: Refreshing state... [id=/aws/lambda/java_lambda_function]
aws_iam_role.iam_role_for_lambda: Refreshing state... [id=lambda-invoke-role]
aws_iam_policy.iam_policy_for_lambda: Refreshing state... [id=arn:aws:iam::554506578892:policy/lambda-invoke-policy]
aws_dynamodb_table.spotify-dynamo-music: Refreshing state... [id=spotify-dynamo-music]
aws_dynamodb_table.spotify-poc: Refreshing state... [id=spotify-poc]
aws_iam_role_policy_attachment.aws_iam_role_policy_attachment: Refreshing state... [id=lambda-invoke-role-20210517054657159100000001]
aws_route53_record.validations["spotify-line.moikilo00.net"]: Refreshing state... [id=Z04052072YGY8CIREK2A2__e2490495fb7f42c5629334ae790825dc.spotify-line.moikilo00.net._CNAME]
aws_api_gateway_resource.proxy: Refreshing state... [id=ixthbt]
aws_api_gateway_method.proxy_root: Refreshing state... [id=agm-uo7vejn591-6s0om962qh-ANY]
aws_lambda_function.java_lambda_function: Refreshing state... [id=java_lambda_function]
aws_api_gateway_method.proxy: Refreshing state... [id=agm-uo7vejn591-ixthbt-ANY]
aws_iam_policy.lambda_dynamo_music: Refreshing state... [id=arn:aws:iam::554506578892:policy/lambda_dynamo_music-policy]
aws_iam_policy.lambda_dynamo: Refreshing state... [id=arn:aws:iam::554506578892:policy/lambda_dynamo-policy]
aws_iam_role_policy_attachment.lambda_dynamo_music: Refreshing state... [id=lambda-invoke-role-20210628073423139200000001]
aws_iam_role_policy_attachment.lambda_dynamo: Refreshing state... [id=lambda-invoke-role-20210517180640035500000001]
aws_api_gateway_integration.lambda_root: Refreshing state... [id=agi-uo7vejn591-6s0om962qh-ANY]
aws_lambda_permission.apigw: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_api_gateway_integration.lambda: Refreshing state... [id=agi-uo7vejn591-ixthbt-ANY]
aws_api_gateway_deployment.example: Refreshing state... [id=7avmde]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_route53_record.validations["spotify-line.moikilo00.net"] has been changed
  ~ resource "aws_route53_record" "validations" {
        id      = "Z04052072YGY8CIREK2A2__e2490495fb7f42c5629334ae790825dc.spotify-line.moikilo00.net._CNAME"
        name    = "_e2490495fb7f42c5629334ae790825dc.spotify-line.moikilo00.net"
        # (5 unchanged attributes hidden)
    }
  # aws_acm_certificate.main has been changed
  ~ resource "aws_acm_certificate" "main" {
        id                        = "arn:aws:acm:us-east-1:554506578892:certificate/cd63d2a1-3d6f-471d-958e-45a76da21eb0"
      ~ status                    = "PENDING_VALIDATION" -> "ISSUED"
      + tags                      = {}
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_acm_certificate_validation.main will be created
  + resource "aws_acm_certificate_validation" "main" {
      + certificate_arn         = "arn:aws:acm:us-east-1:554506578892:certificate/cd63d2a1-3d6f-471d-958e-45a76da21eb0"
      + id                      = (known after apply)
      + validation_record_fqdns = [
          + "_e2490495fb7f42c5629334ae790825dc.spotify-line.moikilo00.net",
        ]
    }

  # aws_api_gateway_domain_name.main will be created
  + resource "aws_api_gateway_domain_name" "main" {
      + arn                     = (known after apply)
      + certificate_arn         = "arn:aws:acm:us-east-1:554506578892:certificate/cd63d2a1-3d6f-471d-958e-45a76da21eb0"
      + certificate_upload_date = (known after apply)
      + cloudfront_domain_name  = (known after apply)
      + cloudfront_zone_id      = (known after apply)
      + domain_name             = "spotify-line.moikilo00.net"
      + id                      = (known after apply)
      + regional_domain_name    = (known after apply)
      + regional_zone_id        = (known after apply)
      + security_policy         = (known after apply)
      + tags_all                = (known after apply)

      + endpoint_configuration {
          + types = (known after apply)
        }
    }

  # aws_lambda_function.java_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "java_lambda_function" {
        id                             = "java_lambda_function"
      ~ last_modified                  = "2021-06-30T02:29:24.777+0000" -> (known after apply)
      ~ source_code_hash               = "bcLUG39S5KUdNPlfVjgow4wyb8Qk5XaCUFDYiDAAar8=" -> "NvvpFkVWZMZ0ohMnPcDcKiI+VlTz3jZIX7oZsNYJZB0="
        tags                           = {}
        # (23 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # aws_route53_record.spotify-line will be created
  + resource "aws_route53_record" "spotify-line" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "spotify-line.moikilo00.net"
      + type            = "A"
      + zone_id         = "Z04052072YGY8CIREK2A2"

      + alias {
          + evaluate_target_health = true
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

Plan: 3 to add, 1 to change, 0 to destroy.
aws_acm_certificate_validation.main: Creating...
aws_lambda_function.java_lambda_function: Modifying... [id=java_lambda_function]
aws_acm_certificate_validation.main: Creation complete after 0s [id=2021-06-30 02:30:13 +0000 UTC]
aws_api_gateway_domain_name.main: Creating...
aws_api_gateway_domain_name.main: Creation complete after 9s [id=spotify-line.moikilo00.net]
aws_route53_record.spotify-line: Creating...
aws_lambda_function.java_lambda_function: Still modifying... [id=java_lambda_function, 10s elapsed]
aws_lambda_function.java_lambda_function: Modifications complete after 12s [id=java_lambda_function]
aws_route53_record.spotify-line: Still creating... [10s elapsed]
aws_route53_record.spotify-line: Still creating... [20s elapsed]
aws_route53_record.spotify-line: Still creating... [30s elapsed]
aws_route53_record.spotify-line: Creation complete after 38s [id=Z04052072YGY8CIREK2A2_spotify-line.moikilo00.net_A]

Warning: Quoted references are deprecated

  on cert-route.tf line 27, in resource "aws_acm_certificate" "main":
  27:   provider          = "aws.virginia"

In this context, references are expected literally rather than in quotes.
Terraform 0.11 and earlier required quotes, but quoted references are now
deprecated and will be removed in a future version of Terraform. Remove the
quotes surrounding this reference to silence this warning.

(and one more similar warning elsewhere)

Apply complete! Resources: 3 added, 1 changed, 0 destroyed.

Outputs:

base_url = "https://uo7vejn591.execute-api.ap-northeast-1.amazonaws.com/test"

```

</details>

